{
	"messages":{
		"discovery":{
			"full": "While driving to the hotel you are pulled over by Officer Barks. He gets out of his car and approaches as you roll down your window. 'I hope you are having a nice day,' Officer Barks greets you. 'I stopped you because we have had some reports of suspicious cats in the area. Do you mind if I search your car for any illegal items?'",
			"simple": "Officer Barks wants to search your storage"
		},
		"investigation":{
			"full": "You tell Officer Barks that you don't believe there is any reason to allow him to search. He looks around your car and says, 'you don't have anything you aren't supposed to, do you?'",
			"simple": "Officer Barks wants to know if you have any illegal items"
		},
		"investigation_successful":{
			"full": "You tell Officer Barks that you are a law abiding cat. Officer Barks takes several long sniffs. 'I detect something that you shouldn't have. I will need to search your car.'",
			"simple": "Officer Barks is going to search your car"
		},
		"investigation_failure":{
			"full": "You tell Officer Barks that you are a law abiding cat. He takes one more look and sniff around your car and says, 'everything appears to be in order here. Have a nice day.'",
			"simple": "Officer Barks is letting you leave"
		},
		"search_consent":{
			"full": "You tell Officer Barks that he is allowed to look through your car. You step out of the driver's seat and follow him back to his vehicle.",
			"simple": "Officer Barks is searching your vehicle"
		},
		"search_probable_cause":{
			"full": "Officer Barks looks into your back seat. 'It looks like you are in possesion of some illegal items,' he says. 'I will need to search your car.' Officer Barks opens your door and gestures for you to get out",
			"simple": "Officer Barks believes he has spotted some illegal items and wants to search your car"
		},
		"search_successful":{
			"full": ": Officer Barks performs a search of your car. He comes back with something in his hands. 'I found this in your car,' he says. 'You are under arrest for illegal possession.'",
			"simple": "Officer Barks is going to take you into custody"
		},
		"search_failure":{
			"full": "Officer Barks performs a search of your car. He comes back with nothing. 'It looks like you were telling the truth,' he says. 'You are free to leave.'",
			"simple": "Officer Barks is letting you leave"
		},
		"admit_guilt":{
			"full": "You tell Officer Barks that you are in possession of some illegal items in the hope that he will go easy on you. 'I appreciate your honesty,' he says as he opens your door. 'Step out of the vehicle. You are under arrest.'",
			"simple": "You are going to jail"
		},
		"comply_detain":{
			"full": "Officer Barks places you under arrest and puts you in his car.",
			"simple": "You are going to jail."
		},
		"crazy_person":{
			"full": "'What kind of crazy person tells an officer they have something illegal when they don't?' Officer Barks asks. He shakes his head and walks back to his car before driving off.",
			"simple": "Officer Barks is letting you go"
		},
		"escape":{
			"full": "You look back and no longer see Officer Barks or any other officers behind you",
			"simple": "You have evaded the police"
		},
		"hiss_success":{
			"full": "You hiss and show your teeth to Officer Barks. He stops dead in his tracks and runs away from you.",
			"simple": "You scared Officer Barks away"
		},
		"hiss_failure":{
			"full": "You hiss and show your teeth to Officer Barks. He replies with a loud bark of his own and a hard bite in response.",
			"simple": "You have angered Officer Barks"
		},
		"run_success":{
			"full": "You get on all fours and make a run for it. Traveling down alleys and side streets you attempt to lose Officer Barks. You take a sharp corner and hide behind a trash can as Officer Barks rounds the same corner. He runs past you undetected.",
			"simple": "You escaped Officer Barks"
		},
		"run_failure":{
			"full": "You get on all fours and make a run for it. Traveling down alleys and side streets you attempt to lose Officer Barks. You take a sharp corner and hide behind a trash can as Officer Barks rounds the same corner. He approaches the trash can and grabs you by the scruff of your neck.",
			"simple": "You are going to jail"
		},
		"fight_success":{
			"full": "You attack Officer Barks. You are able to surprise him and gain the advantage. Several bites and scratches later you are able to flee from Officer Barks",
			"simple": "You escaped Officer Barks"
		},
		"fight_failure":{
			"full": "You attack Officer Barks. You attempt to scratch and bite at him, but Officer Barks retaliates with a hard bite of his own.",
			"simple": "You are going to jail."
		},
		"dead":{
			"full": "Everything goes quiet and dark. The next thing you hear is a voice asking ,'have you been a good kitty?'",
			"simple": "You have died"
		}
	},
	"choices":{
		"permit_search":{
			"id": "permit_search",
			"full": "Give consent to the search"
		},
		"deny_search":{
			"id": "deny_search",
			"full": "Don't give consent to the search"
		},
		"admit_guilt":{
			"id": "admit_guilt",
			"full": "Yes, I have illegal items"
		},
		"deny_guilt":{
			"id": "deny_guilt",
			"full": "No, I don't have anything illegal"
		},
		"comply_search":{
			"id": "comply_search",
			"full": "Of course, Officer"
		},
		"comply_released":{
			"id": "comply_released",
			"full": "Thank the Officer and leave"
		},
		"comply_detain":{
			"id": "comply_detain",
			"full": "Surrender to the Officer"
		},
		"hiss": {
			"id": "hiss",
			"full": "Hiss!"
		},
		"fight": {
			"id": "fight",
			"full": "Fight!"
		},
		"run": {
			"id": "run",
			"full": "Run!"
		},
		"continue":{
			"id": "continue",
			"full": "Continue"
		}
	}
}
