{
	"messages":{
		"discovery":{
			"full": "On your way to the hotel, you're stopped by Officer Barks.  He gets out of his car and walks over to yours.  You roll down the window and say 'Yes Officer?'.  He says 'I hope you're having a nice day.  I stopped you because we've had some reports of suspicious cats in the area.  Do you mind if I take a look around your storage really quick?'",
			"simple": "Officer Bark wants to search your storage."
		},
		"investigation":{
			"full": "You tell Officer Bark that you don't consent to searches.  He takes his flashlight and shines it at your storage while asking you 'You don't have anything you're not supposed to, do you?'",
			"simple": "Officer Bark is asking if you're carrying anything illegal."
		},
		"investigation_successful":{
			"full": "You tell Officer Bark that you're a law abiding cat, but he doesn't buy it.  He says 'I see something that looks illegal, I'm going to have to look around'",
			"simple": "Officer Bark is telling you that he has probable cause to search your vehicle."
		},
		"investigation_failure":{
			"full": "You tell Officer Bark that you're a law abiding cat, and he seems to believe you.  He says 'Well everything looks to be in order, you can be on your way now.'",
			"simple": "Officer Bark is telling you that you're free to leave."
		},
		"search_consent":{
			"full": "You tell Officer Bark that it's perfectly fine if he looks around.  He says 'I appreciate that, if you'd just stand over here please' while gesturing towards his vehicle.",
			"simple": "Officer Bark is asking you to stand by his vehicle while he searches your storage."
		},
		"search_probable_cause":{
			"full": "Officer Barks says 'I'm going to need you to stand over here please' while gesturing towards his vehicle.  Since he saw something illegal in your storage, now he has probably cause to search.",
			"simple": "Officer Bark is asking you to stand by his vehicle while he searches your storage."
		},
		"search_successful":{
			"full": "Officer Bark performs a cursory search of your storage, and eventually comes back from your storage with something in his hands.  He says 'I found some illegal items while searching your car, I'm afraid you're under arrest.'",
			"simple": "Officer Bark is attempting to take you into custody."
		},
		"search_failure":{
			"full": "Officer Bark performs a cursory search of your storage, and when he finishes, he comes back to you and says 'Well, I didn't find anything illegal, so you're free to leave'",
			"simple": "Officer Bark is telling you that you're free to leave."
		},
		"admit_guilt":{
			"full": "You tell Officer Bark that you are in possession of some contraband in hopes that he'll go easy on you.  He says that he appreciates your honesty, but he's still going to have to take you to jail.",
			"simple": "You're going to jail."
		},
		"detain":{
			"full": "Officer Bark loads you into his squad car.  You're going downtown.",
			"simple": "You're going to jail."
		},
		"release":{
			"full": "Officer Bark leaves in his squad car, and you let out a sign of relief.",
			"simple": "You're going on your way"
		},
		"escape":{
			"full": "You look back and it looks like you've escaped!",
			"simple": "You escaped Officer Bark"
		},
		"hiss_success":{
			"full": "You hiss at Officer Bark and he stops dead in his tracks, looks at you, and runs in the other direction as fast as he can.",
			"simple": "You scared Officer Bark off"
		},
		"hiss_failure":{
			"full": "You hiss at Officer Bark and he stops dead in his tracks, looks at you, and lunges directly at you, thrashing his teeth as he moves.  He bites you swiftly and does a good amount of damage to you.",
			"simple": "You anger Officer Bark"
		}
	},
	"choices":{
		"permit_search":{
			"id": "permit_search",
			"full": "Give consent to the search"
		},
		"deny_search":{
			"id": "deny_search",
			"full": "Don't give consent to the search"
		},
		"admit_guilt":{
			"id": "admit_guilt",
			"full": "Yes, I have illegal items"
		},
		"deny_guilt":{
			"id": "deny_guilt",
			"full": "No, I don't have anything illegal"
		},
		"comply_search":{
			"id": "comply_search",
			"full": "Of course Officer"
		},
		"comply_released":{
			"id": "comply_released",
			"full": "Thank you Officer"
		},
		"comply_detain":{
			"id": "comply_detain",
			"full": "I understand"
		},
		"hiss": {
			"id": "hiss",
			"full": "Hiss!"
		},
		"attack": {
			"id": "attack",
			"full": "Attack!"
		},
		"run": {
			"id": "run",
			"full": "Run!"
		},
		"end":{
			"id": "end",
			"full": "End"
		}
	}
}
